<a href="https://colab.research.google.com/github/quantummouse/dm_pandas/blob/master/AlexandriaKalika_Assignment06.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment for Week 6      

Alexandria Kalika

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

## Action Items:       
 Working with strings.

    Clean a column on your data set using regular expression methods.

    Store the cleaned column into another column of your data set and call it “your_col_name_cleaned”.

    *Another data set will be provided if your data set is not appropriate to apply regular expression methods.

1.   Create a function that returns the mean, sum, mode, median, and range (separately)      
2.   Run the function into your chosen data set using the .apply() method.     
3.   Post your work on GitHub

In [2]:
import pandas as pd
import numpy as np
from numpy import NaN, NAN, nan

In [3]:
drugsutil = pd.read_csv("/content/drive/My Drive/Colab Notebooks/State_Drug_Utilization_Data_2010.csv")

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (4,19) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [ ]:
drugsutil.head(5)

  Utilization Type State  ...             Location          NDC
0             FFSU    WI  ...   (37.768, -78.2057)  17478021420
1             FFSU    NH  ...   (47.5362, -99.793)    409116502
2             FFSU    XX  ...                  NaN    338062904
3             FFSU    TN  ...  (41.6772, -71.5101)  68382009906
4             FFSU    WY  ...  (44.0407, -72.7093)    472091145

[5 rows x 20 columns]

In [4]:
#extractColm = drugsutil['Location']
#extractColm
#I'd like to extract the value of the Longitude and Latitude from the parantethis and just have those values in a column
drugsutil['Location_cleaned'] = drugsutil['Location'].str.extract('.*\((.*)\).*', expand=False).str.strip()
drugsutil['Location_cleaned']

0           37.768, -78.2057
1           47.5362, -99.793
2                        NaN
3          41.6772, -71.5101
4          44.0407, -72.7093
                 ...
3124384     40.5773, -77.264
3124385    43.3504, -84.5603
3124386    45.7326, -93.9196
3124387    41.1289, -98.2883
3124388     42.0046, -93.214
Name: Location_cleaned, Length: 3124389, dtype: object

In [ ]:
drugsutil.head(5)
#Shows a new column Location_cleaned and that the data in it has coordinates without paranthesis

  Utilization Type State  ...          NDC   Location_cleaned
0             FFSU    WI  ...  17478021420   37.768, -78.2057
1             FFSU    NH  ...    409116502   47.5362, -99.793
2             FFSU    XX  ...    338062904                NaN
3             FFSU    TN  ...  68382009906  41.6772, -71.5101
4             FFSU    WY  ...    472091145  44.0407, -72.7093

[5 rows x 21 columns]

In [ ]:
#def stats(df)
  #  mean =drugsutil['Package Size'].

drugsutil.apply(np.sum, axis=0)

In [ ]:
#mymean = drugsutil.mean(axis=0, skipna=True, numeric_only=True)
#mysym = drugsutil.sum(axis=0, skipna=True, numeric_only=True)
#mymode = drugsutil.mode(axis=0, numeric_only=True, dropna=True)
#mymedian = drugsutil.median(axis=0, skipna=True, numeric_only=True)

In [ ]:
def stats(df):
    mymean = df.mean(axis=0, skipna=True, numeric_only=True)
    mysum = df.sum(axis=0, skipna=True, numeric_only=True)
    mymode = df.mode(axis=0, numeric_only=True, dropna=True)
    mymedian = df.median(axis=0, skipna=True, numeric_only=True)
    #print (mymean, mysum, mymode, mymedian)
    return mymean, mysum, mymode, mymedian

In [16]:
drugsutilSelect=drugsutil[["Units Reimbursed", "Number of Prescriptions","Total Amount Reimbursed"]]
drugsutilSelect

         Units Reimbursed  Number of Prescriptions  Total Amount Reimbursed
0                     NaN                      NaN                      NaN
1                     NaN                      NaN                      NaN
2             164627000.0                     29.0                  27541.1
3                 11157.5                    296.0                   3131.1
4                     NaN                      NaN                      NaN
...                   ...                      ...                      ...
3124384               NaN                      NaN                      NaN
3124385               NaN                      NaN                      NaN
3124386               NaN                      NaN                      NaN
3124387               NaN                      NaN                      NaN
3124388               NaN                      NaN                      NaN

[3124389 rows x 3 columns]

In [ ]:
#testing a functions 
def stats2():
    mymean = drugsutilSelect.mean(axis=0, skipna=True, numeric_only=True)
    mysum = drugsutilSelect.sum(axis=0, skipna=True, numeric_only=True)
    mymode = drugsutilSelect.mode(axis=0, numeric_only=True, dropna=True)
    mymedian = drugsutilSelect.median(axis=0, skipna=True, numeric_only=True)
    #print (mymean, mysum, mymode, mymedian)
    return mymean, mysum, mymode, mymedian

In [18]:
#making sure there are no missing values
drugsutilSelect.fillna(value=0)

         Units Reimbursed  Number of Prescriptions  Total Amount Reimbursed
0                     0.0                      0.0                      0.0
1                     0.0                      0.0                      0.0
2             164627000.0                     29.0                  27541.1
3                 11157.5                    296.0                   3131.1
4                     0.0                      0.0                      0.0
...                   ...                      ...                      ...
3124384               0.0                      0.0                      0.0
3124385               0.0                      0.0                      0.0
3124386               0.0                      0.0                      0.0
3124387               0.0                      0.0                      0.0
3124388               0.0                      0.0                      0.0

[3124389 rows x 3 columns]

In [109]:
def mean (x):
   mymean = drugsutilSelect.mean(axis=0, skipna=True, numeric_only=True)
   return mymean

def sums (x) :
   mysum = drugsutilSelect.sum(axis=0, skipna=True, numeric_only=True)
   return mysum
def modes (x) : 
   #drugsutilSelect.set_index()
   mymode = drugsutilSelect["Units Reimbursed"].mode()
   mymode2 = drugsutilSelect["Number of Prescriptions"].mode()
   mymode3 = drugsutilSelect["Total Amount Reimbursed"].mode()
   return [mymode, mymode2, mymode3]
def median (x):
   mymedian = drugsutilSelect.median(axis=0, skipna=True, numeric_only=True)
   return mymedian

In [144]:
def ranges (x):
   #drugsutilSelect["Units Reimbursed"].max()-drugsutilSelect["Units Reimbursed"].min()
   y = drugsutilSelect.describe().max()
   #z = drugsutilSelect.describe().max()
  
   print (y)

#finding a range has been challanging in this data and getting the output properly. The describe function has 
#min and max - and that shows the range of values for each column.

In [61]:
drugsutilSelect.apply(mean, axis=0)

                         Units Reimbursed  ...  Total Amount Reimbursed
Units Reimbursed             39630.539370  ...             39630.539370
Number of Prescriptions        623.132629  ...               623.132629
Total Amount Reimbursed      43993.347379  ...             43993.347379

[3 rows x 3 columns]

In [89]:
drugsutilSelect.apply(sums, axis=0)

                         Units Reimbursed  ...  Total Amount Reimbursed
Units Reimbursed             6.091448e+10  ...             6.091448e+10
Number of Prescriptions      9.577916e+08  ...             9.577916e+08
Total Amount Reimbursed      6.762037e+10  ...             6.762037e+10

[3 rows x 3 columns]

In [88]:

drugsutilSelect.apply(modes, axis=0)

            Units Reimbursed  ...    Total Amount Reimbursed
0  0    720.0
dtype: float64  ...  0    720.0
dtype: float64
1   0    15.0
dtype: float64  ...   0    15.0
dtype: float64
2   0    0.01
dtype: float64  ...   0    0.01
dtype: float64

[3 rows x 3 columns]

In [66]:
drugsutilSelect.apply(median, axis=0)

                         Units Reimbursed  ...  Total Amount Reimbursed
Units Reimbursed                  3230.00  ...                  3230.00
Number of Prescriptions             71.00  ...                    71.00
Total Amount Reimbursed           1692.63  ...                  1692.63

[3 rows x 3 columns]

In [102]:
drugsutilSelect.describe()

       Units Reimbursed  Number of Prescriptions  Total Amount Reimbursed
count      1.537059e+06             1.537059e+06             1.537059e+06
mean       3.963054e+04             6.231326e+02             4.399335e+04
std        4.696817e+05             5.206322e+03             6.649862e+05
min        0.000000e+00             1.100000e+01             0.000000e+00
25%        1.102000e+03             2.900000e+01             4.763500e+02
50%        3.230000e+03             7.100000e+01             1.692630e+03
75%        1.200300e+04             2.390000e+02             7.574050e+03
max        1.646270e+08             8.942530e+05             1.484406e+08

In [143]:
drugsutilSelect.apply(ranges, axis=0)
# min and max of each column

Units Reimbursed            0.0
Number of Prescriptions    11.0
Total Amount Reimbursed     0.0
dtype: float64
Units Reimbursed            0.0
Number of Prescriptions    11.0
Total Amount Reimbursed     0.0
dtype: float64
Units Reimbursed            0.0
Number of Prescriptions    11.0
Total Amount Reimbursed     0.0
dtype: float64

Units Reimbursed           None
Number of Prescriptions    None
Total Amount Reimbursed    None
dtype: object